[
    {
        "subreddit": "PoliticalDiscussion",
        "title": "In a recent Tweet, the President of the United States explicitly targeted a company because it acted against his family's business interests. Does this represent a conflict of interest? If so, will President Trump pay any political price?",
        "score": 23084,
        "url": "https://www.reddit.com/r/PoliticalDiscussion/comments/5su9ig/in_a_recent_tweet_the_president_of_the_united/",
        "id": "5su9ig",
        "created": 1486576630.0,
        "body": "From [USA Today](http://www.usatoday.com/story/money/business/2017/02/08/trump-blasts-nordstrom-tweet-over-daughter-ivanka/97644392/):\n\n> President Trump took to Twitter Wednesday to complain that his daughter Ivanka has been \"treated so unfairly\" by the Nordstrom (JWN) department store chain, which has announced it will no longer carry her fashion line.\n\nHere's the full text of the Tweet in question:\n\n> @realDonaldTrump: My daughter Ivanka has been treated so unfairly by @Nordstrom. She is a great person -- always pushing me to do the right thing! Terrible!\n\nIt seems as though President Trump is quite explicitly and actively targeting Nordstrom because of his family's business engagements with the company. This could end up hurting Nordstrom, which could have a subsequent \"chilling\" effect that would discourage other companies from trifling with Trump family businesses. \n\n* Is this a conflict of interest? If so, how serious is it?\n\n* Is this self dealing? I.e., is Trump's motive enrichment of himself or his family? Or might he have some other motive for doing this?\n\n* Given that Trump made no pretenses about the purpose for his attack on Nordstrom, what does it say about how he envisions the duties of the President? Is the President concerned with conflict of interest or the perception thereof?\n\n* What will be the consequences, and who might bring them about? Could a backlash from this event come in the form of a lawsuit? New legislation? Or simply discontentment among the electorate?"
    },
    {
        "subreddit": "PoliticalDiscussion",
        "title": "President Donald Trump has fired FBI Director James Comey",
        "score": 15062,
        "url": "https://www.reddit.com/r/PoliticalDiscussion/comments/6a8jl9/president_donald_trump_has_fired_fbi_director/",
        "id": "6a8jl9",
        "created": 1494366577.0,
        "body": "As of ~5:45 PM EST, James Comey is no longer Director of the FBI.  This follows investigations into the Trump campaign related to its contacts with Russia and comes just days after (former) Director Comey spoke to the Senate Judiciary Committee regarding Russia's role in the election.\n\n[Politico](http://www.politico.com/story/2017/05/09/trump-fires-fbi-director-james-comey-238175?cmpid=sf)\n\n[The New York Times](https://www.nytimes.com/2017/05/09/us/politics/james-comey-fired-fbi.html?action=Click&contentCollection=BreakingNews&contentID=65272941&pgtype=article)\n\n[CNN](http://www.cnn.com/2017/05/09/politics/james-comey-fbi-trump-white-out/index.html)\n\n[The Washington Post](https://www.washingtonpost.com/world/national-security/comey-misstated-key-clinton-email-evidence-at-hearing-say-people-close-to-investigation/2017/05/09/074c1c7e-34bd-11e7-b373-418f6849a004_story.html?utm_term=.c0f17c6f4943?tid=a_breakingnews&hpid=hp_no-name_no-name%3Apage%2Fbreaking-news-bar).\n\n[CNBC: \"Justice Department was told to come up with reasons to fire Comey\"](http://www.cnbc.com/2017/05/09/justice-department-was-told-to-come-up-with-reasons-to-fire-comey-reports-say.html).\n\n*Possibly* related: [CNN exclusive: Grand jury subpoenas issued in FBI's Russia investigation](http://www.cnn.com/2017/05/09/politics/grand-jury-fbi-russia/index.html).\n\nWhere do things go from here?  What does Trump intend to accomplish with this move?  How does this reflect on the administration and what will the larger ramifications be?  What kind of Director will Trump install now and where will the Russia investigation go from here?"
    },
    {
        "subreddit": "PoliticalDiscussion",
        "title": "Michael Flynn has reportedly resigned from his position as Trump's National Security Advisor due to controversy over his communication with the Russian ambassador. How does this affect the Trump administration, and where should they go from here?",
        "score": 9920,
        "url": "https://www.reddit.com/r/PoliticalDiscussion/comments/5txzyf/michael_flynn_has_reportedly_resigned_from_his/",
        "id": "5txzyf",
        "created": 1487045751.0,
        "body": "According to [the Washington Post](https://www.washingtonpost.com/news/post-politics/wp/2017/02/13/michael-flynn-trumps-embattled-national-security-adviser-resigns-amid-controversy-over-communication-with-russian-ambassador/?utm_term=.4bf47a8feabc), Flynn submitted his resignation to Trump this evening and reportedly \"comes after reports that Flynn had misled the vice president by saying he did not discuss sanctions with the Russian ambassador.\"\n\n\nIs there any historical precedent to this? If you were in Trump's camp, what would you do now?"
    },
    {
        "subreddit": "PoliticalDiscussion",
        "title": "Clinton has won the popular vote, while Trump has won the Electoral College. This is the 5th time this has happened. Is it time for a new voting system?",
        "score": 9852,
        "url": "https://www.reddit.com/r/PoliticalDiscussion/comments/5c0pqa/clinton_has_won_the_popular_vote_while_trump_has/",
        "id": "5c0pqa",
        "created": 1478693280.0,
        "body": "In 1824, 1876, 1888, 2000, and now 2016 the Electoral College has given the Presidency to the person who did not receive the plurality of the vote. The National Popular Vote Interstate Compact, which has been joined by 10 states representing 30.7% of the Electoral college have pledged to give their vote to the popular vote winner, though they need to have 270 Electoral College for it to have legal force. Do you guys have any particular voting systems you'd like to see replace the EC?\n\nhttps://en.wikipedia.org/wiki/National_Popular_Vote_Interstate_Compact"
    },
    {
        "subreddit": "PoliticalDiscussion",
        "title": "The CBO just released their report about the costs of the American Health Care Act indicating that 14 million people will lose coverage by 2018",
        "score": 7682,
        "url": "https://www.reddit.com/r/PoliticalDiscussion/comments/5z7h4b/the_cbo_just_released_their_report_about_the/",
        "id": "5z7h4b",
        "created": 1489436726.0,
        "body": "How will this impact Republican support for the Obamacare replacement? The bill will also reduce the deficit by $337 billion. Will this cause some budget hawks and members of the Freedom Caucus to vote in favor of it? \n\nhttp://thehill.com/policy/healthcare/323652-cbo-millions-would-lose-coverage-under-gop-healthcare-plan"
    },
    {
        "subreddit": "PoliticalDiscussion",
        "title": "Megathread: President Trump has been Acquitted by the Senate on both Articles of Impeachment and will not be removed from office",
        "score": 6999,
        "url": "https://www.reddit.com/r/PoliticalDiscussion/comments/ezgw2p/megathread_president_trump_has_been_acquitted_by/",
        "id": "ezgw2p",
        "created": 1580938380.0,
        "body": "Today, February 5, 2020, president Donald Trump has been acquitted by the US Senate on both articles of impeachment and will not face removal from office. Trump is now the third US President to face an impeachment trial, and the third to be acquitted on all charges. \n\nThe verdict is as follows:\n\n-\tARTICLE I: ABUSE OF POWER // 52-48 vote // Not Guilty\n-\tARTICLE II: OBSTRUCTION OF CONGRESS // 53-47 vote // Not Guilty\n\n**Please use this thread to discuss the impeachment inquiry, trial, and final verdict.**\n\n*Media and Articles:*\n\n-\t[PBS News Hour Live Coverage](https://www.youtube.com/watch?v=GwoAUNJgLlU&feature=emb_title)\n\n\n\n-------------\n\n**Discussion Disclaimer:** Please remember to be civil in discussion and remain on-topic. We understand that politics (particularly with the president) are polarizing, and that many of you are passionate about your views. However, this does not give you a free pass to insult other users or all members of a political party/ideology. Comments/users that violate subreddit rules will face moderator action."
    },
    {
        "subreddit": "PoliticalDiscussion",
        "title": "Intel presented, stating that Russia has \"compromising information\" on Trump.",
        "score": 6871,
        "url": "https://www.reddit.com/r/PoliticalDiscussion/comments/5n8tv6/intel_presented_stating_that_russia_has/",
        "id": "5n8tv6",
        "created": 1484094375.0,
        "body": "[Intel Chiefs Presented Trump with Claims of Russian Efforts to Compromise Him](http://www.cnn.com/2017/01/10/politics/donald-trump-intelligence-report-russia/index.html)  \n  \n  \nCNN (and apparently only CNN) is currently reporting that information was presented to Obama and Trump last week that Russia has \"compromising information\" on DJT. This raises so many questions. The report has been added as an addendum to the hacking report about Russia. They are also reporting that a DJT surrogate was in constant communication with Russia during the election.  \n  \n  \n*What kind of information could it be?    \n*If it can be proven that surrogate was strategizing with Russia on when to release information, what are the ramifications?    \n*Why, even now that they have threatened him, has Trump refused to relent and admit it was Russia?  \n*Will Obama do anything with the information if Trump won't?"
    },
    {
        "subreddit": "PoliticalDiscussion",
        "title": "Trump fires only Justice Dept. Official authorized to sign FISA warrants",
        "score": 6829,
        "url": "https://www.reddit.com/r/PoliticalDiscussion/comments/5r5o9g/trump_fires_only_justice_dept_official_authorized/",
        "id": "5r5o9g",
        "created": 1485832309.0,
        "body": "Assistant Attorney General [Sally Q. Yates](https://www.nytimes.com/2017/01/30/us/politics/trump-immigration-ban-memo.html) was fired for refusing to defend Trump's recent Executive Order on Immigration.  One side effect of this decision is that there is now no one at the Justice Department who is authorized to sign FISA warrants.  The earliest replacement would come with the confirmation of Jeff Sessions as Attorney General by the Senate.\n\nWhat effect will this have on US Intelligence collection?  Will this have the side effect of preventing further investigation of Trump's ties with Russia?\n\nWill the Trump admin simply ignore the FISA process and assert it has a right to collect information on anyone they please?\n\nEdit:  With a replacement AAG on-board, it looks like FISA authority is non-issue here.  But it appears we are in a constitutional crisis nonetheless.\n \n[Relevant law:](https://www.law.cornell.edu/uscode/text/5/3345)\n>notwithstanding paragraph (1), the President (and only the President) may direct a person who serves in an office for which appointment is required to be made by the President, by and with the advice and consent of the Senate, to perform the functions and duties of the vacant office temporarily in an acting capacity subject to the time limitations of section 3346\n\nThanks /u/pipsdontsqueak for linking statute"
    },
    {
        "subreddit": "PoliticalDiscussion",
        "title": "Ted Cruz is dropping out of presidential race",
        "score": 6283,
        "url": "https://www.reddit.com/r/PoliticalDiscussion/comments/4hrwn5/ted_cruz_is_dropping_out_of_presidential_race/",
        "id": "4hrwn5",
        "created": 1462321907.0,
        "body": "This is according to [Politico] (http://www.politico.com/story/2016/05/ted-cruz-drops-out-of-presidential-race-222763) and [the Hill] (http://thehill.com/blogs/ballot-box/gop-primaries/278569-cruz-ends-presidential-campaign). \n\nWill Kasich drop out as well? And where will Cruz's delegates go? Then there are the implications for the Never Trump movement, the possibility of a contested convention, and the impact on the Democratic side. Do you guys think Cruz will endorse Trump after everything? Will members of Congress like Lindsey Graham and John McCain? "
    },
    {
        "subreddit": "PoliticalDiscussion",
        "title": "[Megathread] Iran Fires Missiles at U.S. Bases in Iraq Following US Strike Killing IRGC Major General Suleimani",
        "score": 5789,
        "url": "https://www.reddit.com/r/PoliticalDiscussion/comments/elkxvb/megathread_iran_fires_missiles_at_us_bases_in/",
        "id": "elkxvb",
        "created": 1578444890.0,
        "body": "Please use this thread to discuss recent events between the United States and Iran.\n\nKeep in mind:\n\n* Breaking news reports may be based off erroneous or incomplete information\n\n* Subreddit rules still apply in this thread. Please remain civil and focus on substantive discussion.\n\nArticles about Iranian missile attack on US:\n\n[NYTimes](https://www.nytimes.com/2020/01/07/world/middleeast/trump-iran.html#commentsContainer)\n[CNN](https://www.cnn.com/middleeast/live-news/us-iran-soleimani-tensions-intl-01-07-20)"
    },
    {
        "subreddit": "ChangeMyView",
        "title": "CMV: Mike Bloomberg's campaign is proof that the ultra wealthy in the US can afford a higher tax rate with no ill effect on them",
        "score": 65395,
        "url": "https://www.reddit.com/r/changemyview/comments/fdziov/cmv_mike_bloombergs_campaign_is_proof_that_the/",
        "id": "fdziov",
        "created": 1583432538.0,
        "body": "Mike Bloomberg recently dropped out of the 2020 Presidential race after spending over $500 million dollars of his own money on his campaign. Even with this loss, he is still worth over $55 billion dollars.\n\n\nI believe that this effortless spending on Bloombergs part showcases the reality that is wealth inequality between the ultra rich and working class. While I do not believe the rich should give up their fortunes, I do believe that any arguments against taxing them more is simply propaganda from those who hold the wealth and higher power at this point. \n\nCertain media outlets claim that taxing the super wealthy is unfair and would be detrimental to those below them due to \"trickle down\" effects. There is also rhetoric that many self made billionaires worked hard for their fortunes, and that if we as Americans work hard, we might be rich ourselves one day.\n\nI believe that moving forward, we should push for much higher taxes on those earning/worth more than 1 billion USD. If the money Bloomberg spent on his campaign went to actual communities that need funding, actual change could have been possible. Social programs could benefit greatly from these funds, and maybe we could afford to better fund national programs such as healthcare or family leave."
    },
    {
        "subreddit": "ChangeMyView",
        "title": "CMV: Kanye West is a shill for president Trump and running to syphon off young voters from voting for Biden.",
        "score": 54489,
        "url": "https://www.reddit.com/r/changemyview/comments/hlpd7d/cmv_kanye_west_is_a_shill_for_president_trump_and/",
        "id": "hlpd7d",
        "created": 1593966343.0,
        "body": "Kanye West is a shill for president Trump and running to syphon off young voters from voting for Biden. First, he may have an excentric take on reality but can't honestly believe that he has a chance of winning. Second, if he truly wanted to be president, he would have started his campaign last year when he still had a chance to get on state ballots. Third, he has been an avid defender of Trump and the MAGA agenda. Just from reviewing other threads on reddit, there are people willing to vote for him. Generally speaking, the fan base of artists like Kanye skews young and culturally diverse, which are both not likely to vote for Trump. \n\nThere are plenty of other reasons you can say that Kanye is running, but unless you say how my view is flawed I will only consider those reasons as supplemental to the above concept and not as a replacement for.\n\nEDIT: Interesting.... https://www.thedailybeast.com/billionaire-kanye-wests-company-yeezy-llc-gets-multimillion-dollar-ppp-loan-from-trump-admin?utm_source=feedly&utm_medium=webfeeds"
    },
    {
        "subreddit": "ChangeMyView",
        "title": "CMV: Most Americans who oppose a national healthcare system would quickly change their tune once they benefited from it.",
        "score": 45349,
        "url": "https://www.reddit.com/r/changemyview/comments/mzr23d/cmv_most_americans_who_oppose_a_national/",
        "id": "mzr23d",
        "created": 1619537456.0,
        "body": "I used to think I was against a national healthcare system until after I got out of the army. Granted the VA isn't always great necessarily, but it feels *fantastic* to walk out of the hospital after an appointment without ever seeing a cash register when it would have cost me potentially thousands of dollars otherwise. It's something that I don't think just veterans should be able to experience. \n\nBoth [Canada](https://www.healthcare-now.org/blog/new-poll-shows-canadians-overwhelmingly-support-public-health-care/) and [the UK](https://www.npr.org/sections/parallels/2018/03/07/591128836/u-k-hospitals-are-overburdened-but-the-british-love-their-universal-health-care) seem to overwhelmingly love their public healthcare. I dated a Canadian woman for two years who was probably more on the conservative side for Canada, and she could absolutely not understand how Americans allow ourselves to go broke paying for treatment. \n\nThe more wealthy opponents might continue to oppose it, because they can afford healthcare out of pocket if they need to. However, I'm referring to the middle class and under who simply cannot afford huge medical bills and yet continue to oppose a public system.\n\n***Edit: This took off very quickly and I'll reply as I can and eventually (likely) start awarding deltas. The comments are flying in SO fast though lol. Please be patient.***"
    },
    {
        "subreddit": "ChangeMyView",
        "title": "CMV: Donald Trump has not made a single lasting positive impact on the USA during his term as president.",
        "score": 36284,
        "url": "https://www.reddit.com/r/changemyview/comments/iq41dt/cmv_donald_trump_has_not_made_a_single_lasting/",
        "id": "iq41dt",
        "created": 1599747097.0,
        "body": "I write this because I am tired of the wild goose chase that is finding examples of his success. Anything surrounding Donald Trump is shrouded in divisive language and biased opinions. Liberals will have you believe he has done nothing, while conservatives will tout his unlimited success. I must be missing it, because any time I try to research into a topic I get lost in opinion and bias. \n\nI am completely willing to hear and review and accept any examples of success or lasting positive change that has come about as a direct result of Trumps presidency. In fact I want to! It can’t be ALL bad.\n\nEdit1: a lot of responses here. I need to actually read the sources for the claims everyone’s making, so it may take a while for me to respond to each comment, but I will try. I’ll take this chance to remind everyone it’s possible to have civil discourse about even the most divisive topics, even the infamous DJT. Thanks all for the responses.\n\nEdit2: double thanks to those who are responding and engaging one another civilly, and awarding the post. I think it’s important to realize how biased we can become despite the facts. The good things don’t necessarily outweigh the bad, so maybe there’s a counter-post to be made regarding all of the harm DJT has done as well. Every point has a counter point, so take anything you hear with the ole’ grain of salt. I urge everyone to educate themselves and vote in the upcoming election for the candidate they believe in - and don’t let politics negatively impact your happiness. It’s just like any other thing, and can be harmful in high doses.\n\nEdit3: definitely had my view changed. I wanted examples of positives and I received examples with sources. I appreciate everyone’s responses, and feel better about having informed conversation about DJT’s presidency. Still have a lot to read and respond to!"
    },
    {
        "subreddit": "ChangeMyView",
        "title": "CMV: being a conservative is the least Christ-like political view",
        "score": 34752,
        "url": "https://www.reddit.com/r/changemyview/comments/kvwbxj/cmv_being_a_conservative_is_the_least_christlike/",
        "id": "kvwbxj",
        "created": 1610472988.0,
        "body": "From what I know, Christ was essentially a radical leftist. He was all about helping and loving the poor, hungry, disabled, outcast. He would feed 10 people just in case one was going hungry. He flipped a table when banks were trying to take advantage of people. He was anti-capitalist and pro social responsibility to support, love and respect all members of society. He was, based on location and era, probably a person of color. He would not stand for discrimination. He would overthrow an institution that treated people like crap.\n\nOn the other hand, conservatives are all about greed. They are not willing to help people in need (through governmental means) because they “didn’t earn it” and it’s “my tax dollars”. They are very pro-capitalism, and would let 10 people go hungry because one might not actually need the help. They do not believe in social responsibility, instead they prioritize the individual. Very dog eat dog world to them. And, while there are conservatives of color, in America most conservatives are at least a little bit racist (intentionally or not) because most do not recognize how racism can be institutional and generational. They think everyone has the same opportunities and you can just magically work your way out of poverty. \n\nChrist would be a radical leftist and conservatism is about as far as you can get from being Christ-like in politics. The Bible says nothing about abortion (it actually basically only says if someone makes a pregnant woman lose her baby, they have to pay the husband). It does not say homosexuality is sin, just that a man should not lie with a boy (basically, anti pedophilia) based on new translations not run through the filter of King James. Other arguments are based on Old Testament, which is not what Christianity focuses on. Jesus said forget that, listen to me (enter Christianity). Essentially all conservative arguments using the Bible are shaky at best. And if you just look at the overall message of Jesus, he would disagree with conservatives on almost everything.\n\nEDIT: Wow, this is blowing up. I tried to respond to a lot of people. I tried to keep my post open (saying left instead of Democrat, saying Christian instead of Baptist or Protestant) to encourage more discussion on the differences between subgroups. It was not my intent to lump groups together.\n\nOf course I am not the #1 most educated person in the world on these issues. I posted my opinion, which as a human, is of course flawed and even sometimes uninformed. I appreciate everyone who commented kindly, even if it was in disagreement.\n\nI think this is a really interesting discussion and I genuinely enjoy hearing all the points of view. I’m trying to be more open minded about how conservative Christians can have the views they have, as from my irreligious upbringing, it seemed contradictory. I’ve learned a lot today!\n\nI still think some conservatives do not live or operate in a Christ-like manner and yet thump the Bible to make political points, which is frustrating and the original inspiration for this point. However I now understand that that is not ALWAYS the case."
    },
    {
        "subreddit": "ChangeMyView",
        "title": "cmv: The ‘Work hard and don’t give up’ message common on Reddit posts accompanying ‘rags to riches’ stories are damaging lies that imply poverty is most strongly related to lack of effort. Which is proven to be both bullshit and demotivating.",
        "score": 30160,
        "url": "https://www.reddit.com/r/changemyview/comments/jfz65t/cmv_the_work_hard_and_dont_give_up_message_common/",
        "id": "jfz65t",
        "created": 1603371667.0,
        "body": "Here’s a picture of someone living in a slum. Now here’s a picture of them 10 years later going to Harvard. How heartwarming.  If only *every* one of those lazy, dirty shits the world over would be more like him. No, more like *us*. You see, yes I didn’t come from quite that background - but dammit I’ve worked very hard for what I’ve achieved. That’s the difference between scum and me. I pulled myself up by my bootstraps. I’ve overcome many setbacks in my life. And instead of letting them defeat me, I’ve used my wits, my grit and the loving support from my friends and family (who I admit are doing ok and are able to help me - but *only because they* worked hard). I love those Reddit posts. They stop me feeling guilty about other people’s situations. Because it’ll all work out for those who ‘Work hard and Never give up’ and the rest are lazy subhuman scum who don’t deserve any better.\n\nEdit: 23/10/2020 12:35 GMT: Thanks to u/subduedReality for this [video](https://youtu.be/3LopI4YeC4I)  on work, talent and luck"
    },
    {
        "subreddit": "ChangeMyView",
        "title": "CMV: politicians should be required to wear NASCAR-style jumpsuits showing all their major sponsors.",
        "score": 30110,
        "url": "https://www.reddit.com/r/changemyview/comments/hs9xnd/cmv_politicians_should_be_required_to_wear/",
        "id": "hs9xnd",
        "created": 1594907258.0,
        "body": "In recent days some have decried the POTUS and FDOTUS brazenly ignoring federal ethics laws by posing with a certain company's bean products. \n\nBut I welcome it. The ethics rules really just obscure behind a thin veneer the truth of American politics: namely, many politicians are just in it for their friends and donors. \n\nWe shouldn't hide it anymore. Make these allegiances visible, front-and-center. \n\nWe should make it mandatory for politicians appearing in public to wear NASCAR-style jumpsuits with their major sponsors emblazoned across their bodies. Then we'll more readily know who they're beholden to and which companies we may want to boycott or patronize. \n\nChange my view."
    },
    {
        "subreddit": "ChangeMyView",
        "title": "CMV: Democrats and Republicans live in completely different realities and it is destroying our country.",
        "score": 28840,
        "url": "https://www.reddit.com/r/changemyview/comments/kyjzxi/cmv_democrats_and_republicans_live_in_completely/",
        "id": "kyjzxi",
        "created": 1610807877.0,
        "body": "I would guess that a typical Democrat gets their news from CNN, MSNBC, Washington Post, NYT, etc. And the average conservative gets his news from Fox News, Talk Radio, OAN, Breitbart, The Daily Caller, YouTubers like Stephen Crowder and Ben Shapiro, etc. If you go more into the fringes of the right they probably get their news from QAnon and other conspiracy Facebook groups.\n\nThis disparity in where both sides of the political aisle gets their news from is what I believe is causing the massive division and polarization we see. We can't agree on basic facts of reality like whether the 2020 election was fair.\n\nI think one clear measure we can take is enforcing anti-trust laws on broadcast and media companies. The fact that the conservative leaning Sinclair Broadcast Group covers 40% of American households, disproportionately in rural areas, is what is leading to the [brainwashing](https://www.youtube.com/watch?v=_fHfgU8oMSo&ab_channel=Deadspin) of these rural conservatives.\n\nAnother thing we can do is stop with this \"both sides\" meme. Both sides aren't just as bad when it comes to sensational media and disinformation. There is no left equivalent in terms of disinformation to QAnon. Like, we literally have QAnon supporters as congress people (i.e. Marjorie Taylor Greene). MSNBC or CNN never engaged in sensationalism on the level of the [birther movement](https://en.wikipedia.org/wiki/Barack_Obama_citizenship_conspiracy_theories) that Fox News engaged in. Sure, MSNBC, CNN, Washington Post do attack Trump a lot, but they do it on issues that Trump should be attacked on. In contrast, remember when Fox News had a whole media cycle dedicated to [Obama ordering a burger with Dijon mustard](https://www.youtube.com/watch?v=W-WnoZbjdh4&ab_channel=TheDailyShowwithTrevorNoah)?\n\nAt the end of the day, I think it's safe to say that most Americans want less division, less polarization, some agreement and compromise so we can get things done (fixing poverty, homelessness, drug addiction, healthcare reform, immigration reform, etc.). But we can't accomplish any of that if we don't fix the vast disparity in our media and news consumption."
    },
    {
        "subreddit": "ChangeMyView",
        "title": "CMV: \"Folks\" is a reasonably inclusive, gender neutral term, and spelling it as \"folx\" is purely virtue signaling",
        "score": 28821,
        "url": "https://www.reddit.com/r/changemyview/comments/mglg30/cmv_folks_is_a_reasonably_inclusive_gender/",
        "id": "mglg30",
        "created": 1617125788.0,
        "body": "I just want to start by saying this might be the only instance of something that I would actually, unironically call \"virtue signaling\" -- a term I usually disdain and find dismissive of social progress. But in this case, that's exactly what I think it is. \n\n\"Folks\" is an inclusive word. It means \"people.\" It is inherently gender neutral. It is perhaps one of the few English words to address a group of people that is totally inclusive and innocuous. In a time when we are critically evaluating the inclusiveness of language, one would think we're lucky to have a word as neutral and applicable as \"folks.\" \n\nBut apparently, people are intent on spelling it \"folx,\" with the \"x\" indicating inclusiveness. But adding a trendy letter to a word doesn't make the word more inclusive if the word was already inclusive. \"Folks\" didn't exclude people who were non-binary (for instance), because it inherently means \"people\" -- so unless you think non-binary folx aren't *people*, then they were already included and accepted in that term.\n\nI understand there is value in making sure that language is obviously inclusive when speaking to people who may otherwise feel excluded. So, I understand there may be *some* value in taking a word that is potentially vague in its inclusiveness, and tweaking it in a way that is more inclusive. As an example, I understand the intent and value in the term \"latinx\" (which could be its own discussion, but I'm just citing it as a contrary example here). Regardless of someone's feelings on \"latinos/latinas,\" \"latinx\" is a substantive change that would, in theory, have more inclusiveness for those who might feel othered by the gendered terms.  \n\nBut \"folx\" doesn't add or change anything on a substantive level. It is purely a spelling change in a situation where the original spelling was not problematic or exclusive. It uses the letter \"x\" as a reference to the fact that \"x\" has become a signifier of inclusiveness, thereby showing that the user supports inclusiveness. But if people wouldn't have felt excluded otherwise, then signifying this is purely for the user's own ego -- to say, \"Look at what type of person I am; you should feel accepted by me.\" Signaling that you're a good person in a way that doesn't change anything else or help your audience (since there wasn't a problem to begin with) is, by definition, virtue signaling. \n\nThe only conceivable reason I see for the rally behind \"folx\" is the historical usage of \"volk\" in Germany, when Nazi Germany referred to \"the people\" as part of their nationalist identity. But 1) that's a different word in a different language which carries none of that baggage in English-speaking cultures; 2) it's a such a common, generally applicable word that its inclusion within political rhetoric shouldn't forever change the world itself, especially given its common and unproblematic usage for decades since then; and 3) this feels like a shoe-horned, insincere argument that someone might raise as a way to retroactively inject purpose into what is, in actuality, their virtue signaling. And if you were previously unfamiliar with this argument from German history, then that underscores my point about how inconsequential it is to Western English-speaking society. \n\nPeople who spell it as \"folx\" are not mitigating any harm by doing so, and are therefore doing it purely for their own sense of virtue. CMV.\n___\n*Addendum*: I'm not arguing for anyone to stop using this word. I'm not saying this word is harmful. I'm not trying to police anyone's language. I'm saying the word's spelling is self-serving and unhelpful relative to other attempts at inclusive language.    \n\n*Addendums*: By far the most common response is an acknowledgement that \"folks\" is inclusive, but also that \"folx\" is a way to signal that the user is an accepting person. I don't see how this isn't, by definition, virtue signaling.\n\n*Addendum 3*: I'm not making a claim of how widespread this is, nor a value judgment of how widespread it should be, but I promise this is a term that is used among some people. Stating that you've never seen this used doesn't contribute to the discussion, and claiming that I'm making this up is obnoxious.\n\n*Addendum Resurrection*: Read the sidebar rules. Top level comments are to challenge the view and engage in honest discussion. If you're just dropping in from the front page to leave a snarky comment about how you hate liberals, you're getting reported 2 times over. Thanx.\n\n*Addendum vs. Editor*: Read my first few sentences. I used the term \"virtue signaling\" very purposefully. If you want to rant about everything you perceive to be virtue signaling, or tell me that you didn't read this post because it says virtue signaling, your viewpoint is too extreme/reductionist.\n\n*Addendum vs. Editor, Requiem*: The mods must hate me for the amount of rule 1 & 3 reports I've submitted."
    },
    {
        "subreddit": "ChangeMyView",
        "title": "CMV: US presidential candidates should take an exam covering US government and law, foreign policy, as well as undergo a comprehensive cognitive exam.",
        "score": 28651,
        "url": "https://www.reddit.com/r/changemyview/comments/hm5di9/cmv_us_presidential_candidates_should_take_an/",
        "id": "hm5di9",
        "created": 1594032261.0,
        "body": "Edit: Ok, this has been fun and some great conversation, but I am beginning to feel like a one-man army trying to defend the gates of Sparta. \n\nI have changed my mind for three reasons. \n\n1) Test-taking ability is not necessarily an indication of one's ability to run the office of the president. \n\n2) He who creates the questions dictates the barrier for entry. \n\n3) Freedom of speech is a slippery slope, and even though announcing one's intent to run for president can and will continue to be abused, you can't knock out one brick and expect the wall to remain intact. Therefore, I am hereby announcing my bid to run as VP with Kim Kardashian. \n\nI still believe standardized cognitive testing should be administered. This could be automated, perhaps using open-source N-Back software or various standardized cognitive testing designed to screen for early cognitive decline. \n\nRegardless of who you like, this is a democracy, so register to vote and get those ballots in by November! \n\n---- Original Post ----\n\nThe office of the President of the United States is being used as a tool to boost social media presence, to syphon votes, and to simply sell products. This is an abuse of the office of the presidency and should be illegal, especially if someone has zero intent on running or winning. \n\nTo limit entry into this field, and to limit the abuse of power that has been recently demonstrated by Kanye West, it should be illegal to announce you are running for president unless you undergo a comprehensive set of exams that show you have at least a basic mental competency to run the United States of America. \n\nThe results of these exams should be available to everyone as a pass/fail, though the exact scores should be held secret so as not to be used to favor one candidate with a higher score over another. They should cover cognitive, physical, as well as brain scans using MRI, EEG, etc.\n\nWhile these tests may not completely stop such abuse, they would make it far more difficult for any celebrity to simply announce to their millions of Twitter followers that they are running for president. More importantly, voters could be assured that any candidate running for president has passed a basic competency exam, which would prevent candidates from using perceived cognitive decline as a political weapon."
    },
    {
        "subreddit": "AskReddit",
        "title": "People who haven't pooped in 2019 yet, why are you still holding on to last years shit?",
        "score": 221998,
        "url": "https://www.reddit.com/r/AskReddit/comments/ablzuq/people_who_havent_pooped_in_2019_yet_why_are_you/",
        "id": "ablzuq",
        "created": 1546376787.0,
        "body": ""
    },
    {
        "subreddit": "AskReddit",
        "title": "How would you feel about Reddit adding 3 NSFW filters to distinguish between porn, gore, and repetitive posts asking how you would feel about Reddit adding 2 NSFW filters to distinguish between porn and gore?",
        "score": 217925,
        "url": "https://www.reddit.com/r/AskReddit/comments/l7530r/how_would_you_feel_about_reddit_adding_3_nsfw/",
        "id": "l7530r",
        "created": 1611859882.0,
        "body": ""
    },
    {
        "subreddit": "AskReddit",
        "title": "Would you watch a show where a billionaire CEO has to go an entire month on their lowest paid employees salary, without access to any other resources than that of the employee? What do you think would happen?",
        "score": 197605,
        "url": "https://www.reddit.com/r/AskReddit/comments/f08dxb/would_you_watch_a_show_where_a_billionaire_ceo/",
        "id": "f08dxb",
        "created": 1581069212.0,
        "body": ""
    },
    {
        "subreddit": "AskReddit",
        "title": "What if God came down one day and said \"It's pronounced 'Jod' then left?",
        "score": 195910,
        "url": "https://www.reddit.com/r/AskReddit/comments/iwedc5/what_if_god_came_down_one_day_and_said_its/",
        "id": "iwedc5",
        "created": 1600610511.0,
        "body": ""
    },
    {
        "subreddit": "AskReddit",
        "title": "How would you feel about a feature where if someone upvotes a crosspost, the original post is upvoted automatically?",
        "score": 186436,
        "url": "https://www.reddit.com/r/AskReddit/comments/draola/how_would_you_feel_about_a_feature_where_if/",
        "id": "draola",
        "created": 1572832666.0,
        "body": ""
    },
    {
        "subreddit": "AskReddit",
        "title": "How would you feel about a \"if you accidentally scroll to the top, you can go back to where you were,\" button for Reddit?",
        "score": 182975,
        "url": "https://www.reddit.com/r/AskReddit/comments/kr8op6/how_would_you_feel_about_a_if_you_accidentally/",
        "id": "kr8op6",
        "created": 1609883274.0,
        "body": ""
    },
    {
        "subreddit": "AskReddit",
        "title": "Stan Lee has passed away at 95 years old",
        "score": 175373,
        "url": "https://www.reddit.com/r/AskReddit/comments/9whgf4/stan_lee_has_passed_away_at_95_years_old/",
        "id": "9whgf4",
        "created": 1542052467.0,
        "body": "As many of you know today is day that many of us have dreaded. Stan Lee has passed away at the age of 95. He leaves behind a legacy of superheroes and stories that have touched many people's lives for decades. We wanted to make this thread to honor and remember this wonderful man, so please use it discuss his life, his work, [his cameos](https://thumbs.gfycat.com/RapidClearDungenesscrab-small.gif), etc and what they meant to you. \n\nExcelsior!\n\n-The AskReddit mods"
    },
    {
        "subreddit": "AskReddit",
        "title": "Reddit, how would you feel about a law that bans radio stations from playing commercials with honking/beeping/siren noises in them?",
        "score": 160340,
        "url": "https://www.reddit.com/r/AskReddit/comments/9gx68l/reddit_how_would_you_feel_about_a_law_that_bans/",
        "id": "9gx68l",
        "created": 1537293678.0,
        "body": ""
    },
    {
        "subreddit": "AskReddit",
        "title": "Bill Gates said, \"I will always choose a lazy person to do a difficult job because a lazy person will find an easy way to do it.\" What's a real-life example of this?",
        "score": 154342,
        "url": "https://www.reddit.com/r/AskReddit/comments/himsju/bill_gates_said_i_will_always_choose_a_lazy/",
        "id": "himsju",
        "created": 1593521622.0,
        "body": ""
    },
    {
        "subreddit": "AskReddit",
        "title": "What if Earth is like one of those uncontacted tribes in South America, like the whole Galaxy knows we're here but they've agreed not to contact us until we figure it out for ourselves?",
        "score": 152123,
        "url": "https://www.reddit.com/r/AskReddit/comments/kka536/what_if_earth_is_like_one_of_those_uncontacted/",
        "id": "kka536",
        "created": 1608946885.0,
        "body": ""
    }
]